app/controllers/admin/users_controller.rb

  def update
      @user = User.find(params[:id])

      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "test"], ["password_digest", "$2a$12$iSZPrCz27ypTODNxAUZVgubjgD8tT62.kyIPph0R2gh0S.nEaXaq2"], ["updated_at", "2020-03-14 08:01:56.799396"], ["id", 13]]