app/controllers/tasks_controller.rb

  def index
      @tasks = current_user.tasks.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."created_at" DESC  [["user_id", 3]]

  def update
      @task.update!(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "https://www.youtube.com/\r\n\r\n123"], ["updated_at", "2019-12-17 13:26:12.875763"], ["id", 36]]

  def create
      @task = current_user.tasks.new(task_params)

      if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "サンプル"], ["description", "123"], ["created_at", "2019-12-17 13:26:02.282200"], ["updated_at", "2019-12-17 13:26:02.282200"], ["user_id", 3]]